# IsValid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..IsValid Property
Category Class See Also
---
Indicates if the Category is valid or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023.1
# Syntax
C#
---
```text
public bool IsValid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsValid As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsValid {
	bool get ();
}
```

# Remarks
A valid Category is one which is present in the Document's Categories.
# See Also
Category Class
Autodesk.Revit.DB Namespace